#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Воспроизведение видеоданных из сенсора Kinect 2

TODO
"""

# ######################################################################################################################
# Импорт необходимых инструментов
# ######################################################################################################################
import sys  # Доступ к некоторым переменным и функциям Python

sys.path.insert(0, '/Users/dl/GitHub/Liberty/')

# Персональные
import liberty  # Воспроизведение фото/видео данных

from liberty.modules.kinect2.viewer import KinectViewer  # Воспроизведение видеоданных из сенсора Kinect 2

kinect = KinectViewer()